from textwrap import dedent

persian = {
    'greeting': {
        'welcome': dedent("""
        سلام {} عزیز🌹، به ربات چت ناشناس خوش اومدی🙌

        شما میتونی با استفاده از دستور /link لینک خودتو دریافت کنی و به اشتراک بزاری تا بقیه بهت پیام ناشناس بدن. 😉
        و یا با کلیک روی لینک بقیه به اون ها بصورت ناشناس پیام بدی! 😮
    """),
        'link': dedent("""
        این لینک چت شخصیته 👇
        🔗 {}
        با اشتراک گذاری این لینک بقیه میتونن بصورت ناشناس بهت پیام بدن 🫣
    """),
    },
    'nickname': {
        'ask_nickname': dedent("""
        🪪 نام نمایشی فعلی: `{}`
        ⏳ لطفا نام نمایشی که میخوای بجای اسم اصلیت برای بقیه نمایش داده بشه رو برام بفرست.
        """),
        'nickname_was_set': dedent("""
        ✅ نام مستعار با موفقیت به *{}* تغییر یافت.
        """),
    },

    'texting': {
        'sending': {
            'send': dedent("""
            ✍️ در حال ارسال پیام ناشناس به *{}* هستی...
            برای انصراف از دستور /start استفاده کن.      
                    """),
            'sent': dedent("""
                ✅ پیام شما به صورت ناشناس ارسال شد.
                    """),
            'recipient': dedent("""
                💬 پیام ناشناس:
                
                {}
                    """),
        },
        'replying': {
            'send': dedent("""
            جوابتو بنویس براش بفرستم 😁
            برای انصراف از دستور /start استفاده کن.
            """),
            'sent': dedent("""
            جوابتو براش بفرستادم 👍
            """),
            'recipient': dedent("""
            💬 جوابه این پیامت :
            
            {}
            """)
        }
    },
    'blocking': {
        'block?': dedent("""
        ❗️ مطمئنی که می‌خوای این کاربر رو بلاک کنی؟ 
        """),
        'block_confirm': dedent("""
    ✅ **کاربر مورد نظر با موفقیت بلاک شد!**

    🚫 این کاربر دیگه نمی‌تونه به شما پیام بده!

    📜 برای مشاهده لیست افراد بلاک شده از دستور /blocklist استفاده کن.
    """),
        'blocked_by_user': dedent("""
        🚫🙅‍♂️ متاسفم، شما توسط کاربر بلاک شدی، به همین دلیل نمیتونی بهش پیام بدی.
        """)
    },

    'errors': {
        'wrong_id': dedent("""
        ❌ شناسه کاربری اشتباه، لطفاً یک شناسه کاربری معتبر وارد کن.
        """),
        'bot_blocked': dedent("""
        کاربر ربات رو مسدود کرده، پس نمیتونی براش پیامی بفرستی ☹️
        """),
        'no_active_chat': dedent("""
        به کی میخوای پیام بدی ؟! اول برو رو لینک یکی بزن بعد بیا 😒
        """),
        'no_user_found': dedent("""
        متاسفانه شخصی که میخوای بهش پیام بدی تو ربات نیستش 😔
        این میتونه به این دلیل باشه که لینک اشتباهه یا کاربر تاحالا وارد ربات نشده.
        """),
    }
}
