"""
    This file contains the translations for the bot's messages.
    The translations are stored in a dictionary format, where the keys are the language codes
    and the values are dictionaries containing the translations for various messages.
    The translations are organized into categories such as 'greeting', 'nickname', 'texting', etc...
    Each category contains subcategories for different types of messages, such as 'welcome', etc...
    The translations are written in a format that allows for easy formatting with variables,
    such as using curly braces {} to indicate where variables should be inserted into the message.
"""
from textwrap import dedent

translations = {
    'fa': {
        'greeting': {
            'welcome': dedent("""
        سلام <a href="tg://settings"><b>{first_name}</b></a> عزیز 🌹، به <b>اینویزچت</b> خوش اومدی 🙌

        شما میتونی با استفاده از دکمه های پایین از ربات استفاده کنی. 😉
    """),
            'first_time': dedent("""
سلام <a href="tg://settings"><b>{nickname}</b></a> عزیز 🌹، به <b>اینویزچت</b> خوش اومدی 🙌

🤗 این اولین باره که ربات رو استارت میکنی، به همین دلیل نام مستعارت بصورت پیشرفض <b>{nickname}</b> تنظیم شده.

♻️ برای اینکه تغییرش بدی، برو بخش <b>حساب کاربری</b> و بعد روی دکمه <b>تغییر نام نمایشی</b> بزن.

🤔 هر سوالی داشتی میتونی از بخش <b>راهنما</b> جواب بگیری و یا از پشتیبانی بپرسی.
""")
        },
        'link': {
            'link': dedent("""
        🕵️‍♂️ لینک پایین لینک ناشناس شماست. هرکی این  لینک رو داشته باشه میتونه بهت ناشناس پیام بده!
        🔐 تمام پیام ها مستقیم تحت رمزگذاری خود تلگرام هستن.
        ✅ لینک های ناشناس هم برای محافظت از هویت کاربران کاملا ناشناس رمزگذاری شدن.
                                       
        🔗 {link} 👈
        
        <b>❓اگه دوست داشتین برای مدتی از کسی پیامی نگیرید میتونید ربات رو از قسمت "👤 حساب کاربری" خاموش کنید.</b>
    """),
            'share_link': dedent("""
        تا حالا شده بخوای یه چیزی بهم بگی ولی خجالت بکشی؟ 😅  
        خب این فرصتشه! 🎉  
        با زدن روی دکمه پایین می‌تونی یه پیام کاملاً ناشناس برام بفرستی—بدون اسم، بدون سرنخ، فقط حرفای خودت! 🫣  
        یه راز، یه تعریف، یا هرچی که میخوای رو بهم بگو بدون اینکه بفهمم کی هستی! 😎  
        ❤️ راستی تو هم میتونی لینک خودتو به صورت رایگان از ربات بگیری و برای دوستات بفرستی که اونا هم پیام ناشناس بهت بدن!
        """),
            'revoke_link': {
                    'confirm': dedent("""
                ❗️مطمئنی که می‌خوای لینک ناشناس خودتو باطل کنی؟ با اینکار دیگه کسی نمیتونه از لینک قبلی برات پیام ناشناس بفرسته.
                ♻️ با ابطال لینک قبلی، یک لینک جدید برای شما ایجاد می‌شود که می‌توانید از آن استفاده کنید.
                ⏳ دقت کنید که هر ۷ روز یکبار می‌توانید لینک خود را باطل کنید.
                
                <b>⚠️ این عمل غیرقابل بازگشت است و دیگه امکان بازگردانی لینک قبلی وجود ندارد.</b>
                """),
                    'cancel': dedent("""
                خیالت راحت لینکت باطل نشد 😁
                """),
                    'revoked': dedent("""
                <b>✅ لینک ناشناس قبلی شما با موفقیت باطل شد و یک لینک جدید برای شما ایجاد شد.</b>
                ⚠️ توجه داشته باشید که لینک قبلی دیگر قابل استفاده نیست و تمام پیام‌های ناشناس از لینک جدید ارسال خواهد شد.
                ⚜️ لینک جدید شما:                 
                🔗 {link} 👈           
                """),
                    'limit_exceeded': dedent("""
                ❗️ شما در حال حاضر قادر به ابطال لینک ناشناس خود نیستید. مطمعن شوید ۷ روز از آخرین باری که لینک خود را باطل کردین گذشته باشد.
                """),
            },
            'connect_without_link': {
                'send_without_link': dedent("""
        🕊 <b>با این قابلیت میتونی بدون اینکه لینک ناشناس مخاطب مورد نظرتو داشته باشی بهش ناشناس پیام بدی!</b>
        
        • برای اینکار سه راه وجود داره:
                                            
        <b>1.</b> آیدی طرف مورد نظرتو برام بفرستی تا تورو بهش وصل کنم. (مثلا: @Admin)
                                            
        <b>2.</b> آیدی عددی طرف رو برام بفرستی تا تورو بهش وصل کنم. (مثلا: 123456789)
                                            
        <b>3.</b> یک پیام از طرف اینجا فوروارد کنی تا تورو بهش وصل کنم.
        
        <b>❗️ توجه داشته باشید که این قابلیت فقط برای کاربرانی که قبلا ربات رو استارت کردن کار می‌کنه.</b>
                                        """),
                'cancel': dedent("""
        ❌ ارسال بدون لینک <b>لغو</b> شد.
        """),
                'found': dedent("""
        ✅ کاربر مورد نظر پیدا شد!
        ⏳ <i>درحال وصل شدن...</i>
        """),
                'not_found': dedent("""
        ❌ <b>کاربر مورد نظر پیدا نشد.</b>
        این میتونه به دلیل اینکه اطلاعات اشتباه وارد کردین یا اگه پیامی فوروارد کردین طرف فوروارد هاشو مخفی کرده!
        شایدم صرفا کاربر تو ربات عضو نیست 🤷‍♂️
        """),
            },
        },
        'nickname': {
            'ask_nickname': dedent("""
        🪪 نام نمایشی فعلی: `{current_nickname}`
        💠 نام اکانت تلگرام شما: `{current_firstname}`
        ⏳ لطفا نام نمایشی که میخوای بجای اسم اصلیت برای بقیه نمایش داده بشه رو برام بفرست.
        """),
            'nickname_was_set': dedent("""
        ✅ نام نمایشی شما با موفقیت به <b>{nickname}</b> تغییر یافت.
        از این به بعد هرکسی از طریق لینک شما خواست بهتون پیام بده این نام نمایشی رو میبینه.
        """),
            'cancelled': dedent("""
        ❌ تغییر نام نمایشی <b>لغو</b> شد.
        """)
        },
        'texting': {
            'sending': {
                'text': {
                    'send': dedent("""
            ✍️ در حال ارسال پیام ناشناس به <b>{nickname}</b> هستی...
                    """),
                    'sent': dedent("""
                ✅ پیام شما <b>با موفقیت</b> به صورت ناشناس ارسال شد.
                    """),
                    'recipient': dedent("""
                💬 یک پیام ناشناس:
                
                {message}
                
                👤 آیدی ناشناس فرستنده: {sender_anon_id}
                    """),
                },
                'sticker': {
                    'sent': dedent("""
                ✅ استیکر شما به صورت ناشناس ارسال شد.
                """),
                    'recipient': dedent("""
                 📸 استیکر ناشناس 👇

                👤 آیدی ناشناس فرستنده: {}
                """)
                },
                'photo': {
                    'sent': dedent("""
                ✅ عکس شما به صورت ناشناس ارسال شد.
                """),

                    'recipient': dedent("""
                 📸 عکس ناشناس:

                 {}

                👤 آیدی ناشناس فرستنده: {}
                """)
                },
                'video': {
                    'recipient': dedent("""
                 📸 فیلم ناشناس:

                 {}

                👤 آیدی ناشناس فرستنده: {}
                """)
                },
                'support': dedent("""
            😁 <b>شما به پشتیبانی وصل شدین!</b>
            ✍️ پیام تون رو ارسال کنید تا برای ادمین ها بفرستم.
            
            ❗️ دقت کنید حجم پیام ها زیاده و احتمال داره زمان ببره تا ادمین ها پاسخ بدن، لطفا صبور باشید.
            """),
                'cancelled': dedent("""
            ❌ گفت‌وگو <b>لغو</b> شد.
            """),
            },
            'replying': {
                'send': dedent("""
            جوابتو بنویس براش بفرستم 😁
            """),
                'sent': dedent("""
            جوابتو براش فرستادم 👍
            """),
                'recipient': dedent("""
            💬 جوابه این پیامت :

            {}

            👤 آیدی ناشناس فرستنده: {}
            """),
                'cancelled': dedent("""
            ❌ پاسخ دادن <b>لغو</b> شد.
            """)
            },
            'reaction': {
                'recipient': dedent("""
            طرف مقابل به این پیام <b>ریاکشن</b> نشان داد. ✍️
            """),
            },
            'seen': {
                'sent': dedent("""
            این پیام برای فرستنده به ‌عنوان «این پیامتو دیدم👀» علامت‌گذاری شد. ✅
            """),
                'recipient': dedent("""
            پیامت توسط گیرنده دیده شد. 👀️
            """),

            },
            'tools': {
                'announce': dedent("""
            ❓ تا 3 ثانیه دیگر میتونی پیامت رو حذف کنی.
            """),
                'editing': {
                    'send': dedent("""
            ❓ لطفا روی این پیام ریپلای کن و پیام جدید خودت رو بفرست.
            """),
                    'sent': dedent("""
            ✅ پیام مورد نظر با موفقیت ویرایش شد.
            """),
                    'recipient': dedent("""
                💬 پیام ناشناس:

                {message}

                👤 آیدی ناشناس فرستنده: {anon_id}
                ♻️ ویرایش شده در {edited_at}
                    """),

                },
                'delete':
                    {
                        'deleted': dedent("""
                    🗑 پیام مورد نظر با موفقیت *حذف* شد.
                    """),
                        'didnt_send': dedent("""
                    ❌ پیام شما به دلیل اینکه <b>حذفش</b> کردین ارسال نشد.
                    """),
                    },
            },
        },
        'blocking': {
            'block?': dedent("""
        ❗️ مطمئنی که می‌خوای این کاربر رو بلاک کنی؟ 
        """),
            'block_confirm': dedent("""
    ✅ **کاربر مورد نظر با موفقیت بلاک شد!**
    👤 شناسه کاربر بلاک شده: *{}*
    🚫 این کاربر دیگه نمی‌تونه به شما پیام بده!

    📜 برای مشاهده لیست افراد بلاک شده از دکمه های زیر استفاده کن.
    """),
            'blocked_by_user': dedent("""
        🚫 متاسفم، شما توسط کاربر بلاک شدی، و یا شما این کاربر رو بلاک کردین، به همین دلیل نمیتونی بهش پیام بدی.
        """),
            'blocked': dedent("""
                             🚫 شما این کاربر رو بلاک کردین به همین دلیل نمیتونین بهش پیام بدی.
        """),
            'blocklist': dedent("""
        *📋 لیست افراد بلاک شده:*
        ❗️ این شناسه‌ها برای ربات منحصر به فرد هستند.
        🔓 برای آنبلاک کردن روی شناسه مورد نظر کلیک کن.
        """),
            'blocklist_empty': dedent("""
        🚫 لیست افراد بلاک شده خالیه ! برو اول یکیو بلاک کن.
        """),
            'unblock?': dedent("""
        ❗️ مطمئنی که می‌خوای این کاربر با شناسه *{}* آنبلاک کنی؟ 
        """),
            'unblock_confirm': dedent("""
        ✅ کاربر مورد نظر به شناسه {anon_id} با موفقیت آنبلاک شد!
        """),
            'self': dedent("""
        نمیتونی خودتو بلاک کنی که 😐
        """),
            'support': dedent("""
        نمینونی پشتیبانی رو بلاک کنی دوست عزیز 😐
        """),
            'already_blocked': dedent("""
        شما قبلا این شخص رو بلاک کردین !
        """)
        },
        'reporting': {
            'send': dedent("""
        لطفا از پیام متخطی عکس بگیرید و به پشتیبانی ارسال کنید.
        """)
        },
        'support': {
            'send': dedent("""
        💬 برای ارتباط با پشتیبانی میتونی به صورت ناشناس به آیدی زیر در ربات پیام بدی.
        🔗 t.me/InvisChatBot?start=support
        """),
            'guide': dedent("""
        
        📚 <b> لطفا درصورت داشتن مشکل یا سوال اول راهنما رو مطالعه کنید. اگر بعد از مطالعه نیاز به راهنمایی بیشتر داشتین به پشتیبانی پیام بدین. </b>
        
        🧡 اگر پیشنهادی دارین یا صرفا دوست داشتین چیزی بگین، میتونین از طریق پشتیبانی بگین.

        """),
            'faq': {
                'explanation': dedent("""
        <b>👇 برای دیدن هر کدوم از راهنما، روی دکمه مربوطه کلیک کنید.</b>
        """),
                'what_is_invischat': dedent("""
        <b>🤔 این ربات چیه؟ و چیکار میکنه؟</b>
        
        🔸 ربات <b>اینویزچت</b> یک ربات پیام ناشناس است که به کاربراش این امکان رو میده بدون شناسایی شدن برای همدیگه پیام ناشناس بفرستن! 🔥
        
        🔸 مثلا اگه انتقادی، تعریفی، و یا حتی اعترافی داشتی که میخوای به کسی بگی بدون اینکه هویتت فاش بشه میتونی از طریق همین ربات بهش بگی بدون اینکه بفهمه تو کی هستی 😉
                                            
        🔸 میتونید حتی بازی های گروهی انجام بدین! برای مثال میتونید یکی از دوستاتون رو انتخاب کنید و با استفاده از همین ربات ازش سوال های خاص بپرسین و اون هم جواب بده بدون اینکه بفهمه کدومتون سوال رو پرسیده 😁
    """),
                'how_to_use': dedent("""
        <b>🛠️ چطور از ربات استفاده کنم؟</b>

        🔸 استفاده از این ربات خیلی راحته! فقط کافیه لینک ناشناس خودت رو از ربات بگیری و پخش کنی تا بقیه بتونن راحت بهت پیام ناشناس بدن. 🕵️‍♂️
        
        🔸 میتونی لینکت رو از دکمه '<b>🔗 لینک ناشناس من</b>' بگیری و برای کپی روی دکمه شیشه ای '<b>کپی کردن لینک</b>' بزنی تا لینک برات کپی بشه.

        🔸 حالا که لینکت رو داری میتونی اونو توی بایو تلگرام بزاری تا هرکسی پروفایلت رو باز کرد لینکو ببینه، یا حتی میتونی اونو توی اینستاگرام بزاری!

        🔸 یا خودت با استفاده از لینک یک شخص دیگه میتونی بهش پیام ناشناس بدی و باهم ناشناس حرف بزنید. 🗣
                                     
        🔸 خیلی هم راحت میتونی روی دکمه پاسخ که زیر پیام دریافتی میاد به پیام طرف پاسخ بدی! همچنین میتونی از قابلیت های دیگه هم که بصورت دکمه ای زیر همون پیام هستن استفاده کنی ! 🔥
            """),
                'how_to_report_user': dedent("""
            <b>🚨 چطور کاربر رو گزارش بدم؟</b>

            🔸 به دلیل اینکه ما هیچ پیامی رو ذخیره نمیکنیم حتی بصورت موقت، امکان اضافه کردن دکمه گزارش زیر پیام ها وجود ندارد.
            
            🔸 برای گزارش کردن کسی میتونید اسکرین شات از کله صفحه یعنی بدون کات کردن بگیرید و برای پشتیبانی ارسال کنید.
            
            🔸 دقت کنید که تنها پیام های <b>تهدیدآمیز</b> قابل قبول هستند و درصورت شدید بودن موضوع هویت گزارش شونده رو به گزارش دهنده افشا میکنیم.
            
            🔸 پیام های توهین آمیز و کلکل قابل قبول نیستند و درصورتی که اینگونه پیام ها آزارتون میدن طرف مورد نظر رو بلاک کنید.
                                             
            ❗️ دقت کنید که بعضی اشخاص هستند که دوست دارند شمارو اذیت کنند و قصد جدی ندارند، لطفا اونهارو دست بالا نگیرید تا آرامشتون حفظ بشه.
            """),
                'how_to_connect_to_speceific_user': dedent("""test4"""),
            },
            'about':  dedent("""
        *🤖 درباره ربات invisChat | اینویزچت*
                             
        📅 *تاریخ راه‌اندازی:* نوامبر 2024
        🧑‍💻 *کانال ربات:* [invisChat Channel](t.me/invisChatChannel)
        🛠️ *نسخه ربات:* {last_tag}
        """)
        },
        'account': {
            'show': dedent("""
        👤 شناسه ناشناس: `{anon_id}`
        🪪 نام نمایشی: *{nickname}*
        📅 تاریخ عضویت: {joined_at}
        """),
            'referral': {
                'invite_self': dedent("""
            کلک نمیتوتی خودتو دعوت کنی که 😉
            """),
                'referred': dedent("""
            قبلا یکی دعوتت کرده، نمیتونی دوباره دعوت بشی 😕
            """)
            },
            'bot_status': {
                'self': {
                    'status_changed': {
                        'off': dedent("""
                    وضعیت ربات به {status} تغییر یافت.
                    تا زمانی که ربات در این وضغیت باشه نمیتونی پیامی ارسال یا دریافت کنی.
                    """),
                        'on': dedent("""
                    وضعیت ربات به {status} تغییر یافت.
                    از الان به بعد دوباره میتونی پیام دریافت و ارسال کنی.
                    """),
                    },
                    'off': dedent("""
                    ✋ ربات در حالت خاموش است، برو اول ربات از قسمت حساب کاربری روشن کن.
                    """)
                },
                'recipient': {
                    'off': dedent("""
                    ✋ متاسفانه شخص مورد نظر ربات رو خاموش کرده.
                    """)
                }
            },
            'ban': {
                'banned': dedent("""
                                 شما بن شدید و دیگر نمی‌توانید از ربات استفاده کنید.
                """),
                'unbanned': dedent("""
                                 شما از بن خارج شدید و می‌توانید دوباره از ربات استفاده کنید.
                """),
            },
        },
        'errors': {
            'wrong_id': dedent("""
        ❌ شناسه کاربری اشتباه، لطفاً یک شناسه کاربری معتبر وارد کن.
        """),
            'bot_blocked': dedent("""
        کاربر ربات رو مسدود کرده، پس نمیتونی براش پیامی بفرستی ☹️
        """),
            'no_active_chat': dedent("""
        به کی میخوای پیام بدی ؟! اول برو رو لینک یکی بزن بعد بیا 😒
        """),
            'no_user_found': dedent("""
        متاسفانه شخصی که میخوای بهش پیام بدی تو ربات نیستش 😔
        این میتونه به این دلیل باشه که لینک اشتباهه یا کاربر تاحالا وارد ربات نشده.
        """),
            'restart_required': dedent("""
        ⭕ لطفا با دستور /start ربات را مجددا راه‌اندازی کنید.
        """),
            'no_cancel': dedent("""
        از کجا میخوای انصراف بدی ؟!
        """),
            'unknown_media': dedent("""
        🤔 ببخشید ولی ظاهرا ربات از نوع پیام شما پشتیبانی نمیکنه.
        """),
            'cant_message_self': dedent("""
        میدونم داری به خودت پیام میدیا کلک 😉
        """),
            'cant_mark_message': dedent("""
        متاسفانه قادر برای علامت گذاری این پیام نیستیم 😔
        """),
            'user_not_found': dedent("""
        ❌ کاربر پیدا نشد، احتمالا کاربر لینک خودشو باطل کرده.
        """),
            'unknown_action': dedent("""
        ❌ عمل ناشناخته، اگه مشکل ادامه داشت ربات رو مجدد استارت بزنید.
        """),
            'placeholder': dedent("""
        ❗️ این دکمه فقط برای نمایش است و هیچ عملی انجام نمیدهد.
        """),
            'same_reaction': dedent("""
                    ریاکشن قبلی شما همین بود، لطفا یک ریاکشن جدید انتخاب کنید.
        """),
            'updating': dedent("""
            <b>⚠️ ربات بدلیل ارتقا و بروزرسانی موقتا در دسترس نیست.</b>
            <b>با تشکر از صبر و شکیبایی شما.🌹</b>
            """)
        },
        'admin': {
            'panel':
                dedent("""
                🤝 سلام ادمین *{name}* عزیز!
                به پنل مدیریتی خوش اومدی ❤️
                """),
            'stats': {
                'chats': dedent("""
        🎉 *وضعیت ربات - گزارش چت ها* 🎉
        
        💬 *چت‌های ایجاد شده:*

        🟢 امروز: *{chat_today}*
        🔵 این هفته: *{chat_week}*
        🟠 این ماه: *{chat_month}*
        🔴 امسال: *{chat_year}*
        🌍 مجموع چت‌ها: *{chat_all_time}*
        
         ✍️ مجموع پیام ها: *{total_messages}*
        
        📅 تاریخ این آمار: {stats_date}
        """),
                'users': dedent("""
        🎉 *وضعیت ربات - گزارش کاربران* 🎉
        
        📅 *آمار کاربران جدید:*

        🟢 امروز: *{today}* نفر
        🔵 این هفته: *{week}* نفر
        🟠 این ماه: *{month}* نفر
        🔴 امسال: *{year}* نفر
        🌍 مجموع کل کاربران: *{all_time}* نفر
        
        📅 تاریخ این آمار: {stats_date}
        """),
                'new_user': dedent("""
                🎉 *کاربر جدید* 🎉
                
                👤 {first_name} {last_name} (@{username})
                🪪 {nickname}
                🆔 `{user_id}` `{anon_id}`
                📅 {joined_at}
                ---------------------------------
                """),
            },
            'user': {
                'info': dedent("""
        🎉 *وضعیت کاربر - گزارش اطلاعات* 🎉

        📅 *اطلاعات کاربر:*

        🟢 شناسه کاربر: `{user_id}`
        🔵 شناسه ناشناس: `{anon_id}`
        🟠 نام مستعار: *{nickname}*
        🔴 تاریخ عضویت: *{joined_at}*
        🟢 نام کاربری: {username}
        🔵 نام کاربر: {first_name}
        🔵 فامیلی کاربر: {last_name}
        🔴 وضعیت ربات: *{is_bot_off}*
        🟢 وضعیت ادمین: *{is_admin}*
        🔴 وضعیت بن: *{is_banned}*
        🟠 بن شده توسط: *{banned_by}*
        🟠 تاریخ بن شدن: *{banned_at}*
                               
        💬 *چت‌ها و ارتباطات:*

        🟢 تعداد چت‌ها: *{chats_count}*
        🔴 تعداد کاربران بلاک شده: *{blocks_count}*

        📈 _با آرزوی بهترین‌ها برای شما!_
        """),
                'ban': {
                    'success': dedent("""
        ✅ کاربر با موفقیت بن شد.
        👤 شناسه کاربر بن شده: `{user_id}`
        🟢 شناسه ناشناس: `{anon_id}`
        🔴 نام کاربر: {first_name}
        🔴 فامیلی کاربر: {last_name}
        🔵 نام کاربری: {username}
        🪪 نام مستعار: *{nickname}*
        📅 تاریخ عضویت: *{joined_at}*
        📅 تاریخ بن شدن: *{banned_at}*
        """),
                },
                'unban': {
                    'success': dedent("""
        ✅ کاربر با موفقیت آنبن شد.
        👤 شناسه کاربر آنبن شده: `{user_id}`
        🟢 شناسه ناشناس: `{anon_id}`
        🔴 نام کاربر: {first_name}
        🔴 فامیلی کاربر: {last_name}
        🔵 نام کاربری: {username}
        🪪 نام مستعار: *{nickname}*
        📅 تاریخ عضویت: *{joined_at}*
        📅 تاریخ آنبن شدن: *{unbanned_at}*
        """),
                },
                'ban_list': {
                    'empty': dedent("""
        🚫 لیست کاربران بن شده خالی است.
        """),
                    'list': dedent("""
        *📋 لیست کاربران بن شده:*
        ❗️ این شناسه‌ها برای ربات منحصر به فرد هستند.
                                   {ban_list}
        🔓 برای آنبن کردن روی شناسه مورد نظر کلیک کن
        .
        """),
            },
            'errors': {
                'info': {
                    "wrong_format": dedent("""
                ❌ Wrong Format
                ^ Correct Format: /info <anon_id>
                """),
                    "not_found": dedent("""
                ❌ No User Found, Make Sure The Anonymous Id Is Correct.
                """)
                },
                'ban': {
                    "wrong_format": dedent("""
                ❌ Wrong Format
                ^ Correct Format: /ban <anon_id>
                """),
                    "not_found": dedent("""
                ❌ No User Found, Make Sure The Anonymous Id Is Correct.
                """),
                    "already_banned": dedent("""
                ❌ User Already Banned
                """),
                    "admin_ban": dedent("""
                ❌ You Can't Ban An Admin
                """)
                },
                'unban': {
                    "wrong_format": dedent("""
                ❌ Wrong Format
                ^ Correct Format: /unban <anon_id>
                """),
                    "not_found": dedent("""
                ❌ No User Found, Make Sure The Anonymous Id Is Correct.
                """),
                    "not_banned": dedent("""
                ❌ User Not Banned
                """),
                }
            }
        },
            'errors': {
                'ban': {
                    "wrong_format": dedent("""
                ❌ Wrong Format
                ^ Correct Format: /ban anon_id or user_id
                """),
                    "not_found": dedent("""
                ❌ No User Found, Make Sure The Anonymous Id Is Correct.
                """),
                    "already_banned": dedent("""
                ❌ User Already Banned
                """),
                    "admin_ban": dedent("""
                ❌ You Can't Ban An Admin
                """)
                },
                'unban': {
                    "wrong_format": dedent("""
                ❌ Wrong Format
                ^ Correct Format: /unban anon_id or user_id
                """),
                    "not_found": dedent("""
                ❌ No User Found, Make Sure The Anonymous Id Is Correct.
                """),
                    "not_banned": dedent("""
                ❌ User Not Banned
                """),
                },
                'info': {
                    "wrong_format": dedent("""
                ❌ Wrong Format
                ^ Correct Format: /info anon_id or user_id
                """),
                    "not_found": dedent("""
                ❌ No User Found, Make Sure The Anonymous Id or User Id Is Correct.
                """)
                },
            },
            'help': dedent("""
                           /admin - Admin Panel
                           /info - User Info
                           /ban - Ban User
                           /unban - Unban User
                           """
                           ),
            'ban_list': {
                'empty': dedent("""
        🚫 لیست کاربران بن شده خالی است.
        """),
                'list': dedent("""
        *📋 لیست کاربران بن شده:*
         ------------------------
        `{ban_list}`
        """),
        },
            'broadcast': {
                'send': dedent("""
                لطفا پیامی که میخواهید به همه ارسال کنید رو بفرستید.
            """),
                'sent': dedent("""
                پیام شما با موفقیت به {users_count} کاربر ارسال شد.
                """),
                'cancel': dedent("""
                ارسال همگانی لغو شد.
                """)
            },
        'ad': {
            'force_join': dedent("""
        برای استفاده از ربات باید اول عضو کانال های زیر بشی 👇
        """),
            'not_joined': dedent("""
        هنوز عضو کانال ها نشدی !
        """),
            'banner': dedent("""
        محل درج بنر تبلیغات شما، برای ارتباط به پشتیبانی پیام دهید.
        """)
        }
    },
    'en': {}
    }
}
